In [1]:
#Importing Libraries
import pandas as pd
import numpy as np

In [2]:
#Loading data
df=pd.read_csv(r"C:\Users\Bhargav\Downloads\Walmart.csv")

In [3]:
#Top 5 rows
df.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,$74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,$15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48
2,3,WALM067,Haltom City,Home and lifestyle,$46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33
3,4,WALM064,Bedford,Health and beauty,$58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33
4,5,WALM013,Irving,Sports and travel,$86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48

In [4]:
# Shape of the data
df.shape

(10051, 11)

In [5]:
#Bottom 5 rows
df.tail()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
10046,9996,WALM056,Rowlett,Fashion accessories,$37,3.0,03/08/23,10:10:00,Cash,3.0,0.33
10047,9997,WALM030,Richardson,Home and lifestyle,$58,2.0,22/02/21,14:20:00,Cash,7.0,0.48
10048,9998,WALM050,Victoria,Fashion accessories,$52,3.0,15/06/23,16:00:00,Credit card,4.0,0.48
10049,9999,WALM032,Tyler,Home and lifestyle,$79,2.0,25/02/21,12:25:00,Cash,7.0,0.48
10050,10000,WALM069,Rockwall,Fashion accessories,$62,3.0,26/09/20,9:48:00,Cash,3.0,0.33

In [6]:
# Statistical summary of the data
df.describe()

         invoice_id      quantity        rating  profit_margin
count  10051.000000  10020.000000  10051.000000   10051.000000
mean    5025.741220      2.353493      5.825659       0.393791
std     2901.174372      1.602658      1.763991       0.090669
min        1.000000      1.000000      3.000000       0.180000
25%     2513.500000      1.000000      4.000000       0.330000
50%     5026.000000      2.000000      6.000000       0.330000
75%     7538.500000      3.000000      7.000000       0.480000
max    10000.000000     10.000000     10.000000       0.570000

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10051 entries, 0 to 10050
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      10051 non-null  int64
 1   Branch          10051 non-null  object
 2   City            10051 non-null  object
 3   category        10051 non-null  object
 4   unit_price      10020 non-null  object
 5   quantity        10020 non-null  float64
 6   date            10051 non-null  object
 7   time            10051 non-null  object
 8   payment_method  10051 non-null  object
 9   rating          10051 non-null  float64
 10  profit_margin   10051 non-null  float64
dtypes: float64(3), int64(1), object(7)
memory usage: 863.9+ KB

In [8]:
#Duplicate Rows
df.duplicated().sum()

51

In [9]:
#Droping Duplicate Rows
df.drop_duplicates(inplace=True)
df.duplicated().sum()

0

In [10]:
df.shape

(10000, 11)

In [11]:
#Null Values
(df.isnull().sum()/df.shape[0])*100

invoice_id        0.00
Branch            0.00
City              0.00
category          0.00
unit_price        0.31
quantity          0.31
date              0.00
time              0.00
payment_method    0.00
rating            0.00
profit_margin     0.00
dtype: float64

In [12]:
# Droping Null Values
df.dropna(inplace=True)

In [13]:
df.isnull().sum()

invoice_id        0
Branch            0
City              0
category          0
unit_price        0
quantity          0
date              0
time              0
payment_method    0
rating            0
profit_margin     0
dtype: int64

In [14]:
df.shape

(9969, 11)

In [15]:
# Data types of each column
df.dtypes

invoice_id          int64
Branch             object
City               object
category           object
unit_price         object
quantity          float64
date               object
time               object
payment_method     object
rating            float64
profit_margin     float64
dtype: object

In [16]:
# We need to convert unit price into float and date and time as datetime

In [17]:
df['unit_price']

0       $74.69
1       $15.28
2       $46.33
3       $58.22
4       $86.31
         ...
9995       $37
9996       $58
9997       $52
9998       $79
9999       $62
Name: unit_price, Length: 9969, dtype: object

In [18]:
df['unit_price']=df['unit_price'].str.replace("$", "").astype('float')

In [19]:
df.rename(columns={'unit_price': 'unit_price($)'}, inplace=True)

In [20]:
df['date_time'] = pd.to_datetime(df['date'] + ' ' + df['time'])

C:\Users\Bhargav\AppData\Local\Temp\ipykernel_18548\4262180034.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df['date_time'] = pd.to_datetime(df['date'] + ' ' + df['time'])

In [21]:
df.drop(['date','time'],axis=1,inplace=True)

# Business Analysis

● Question: What are the different payment methods, and how many transactions and
items were sold with each method?

In [22]:
df['payment_method'].value_counts()

payment_method
Credit card    4256
Ewallet        3881
Cash           1832
Name: count, dtype: int64

In [23]:
df.groupby('payment_method')['quantity'].sum()

payment_method
Cash           4984.0
Credit card    9567.0
Ewallet        8932.0
Name: quantity, dtype: float64

● Question: Which category received the highest average rating in each branch?

In [24]:
avg_ratings = df.groupby(['Branch', 'category'])['rating'].mean().reset_index()
highest_avg_rating_category = avg_ratings.loc[avg_ratings.groupby('Branch')['rating'].idxmax()]
highest_avg_rating_category

      Branch                category    rating
0    WALM001  Electronic accessories  7.450000
6    WALM002      Food and beverages  8.250000
14   WALM003       Sports and travel  7.500000
17   WALM004      Food and beverages  9.300000
23   WALM005       Health and beauty  8.366667
..       ...                     ...       ...
501  WALM096       Sports and travel  9.600000
504  WALM097      Food and beverages  7.675000
510  WALM098       Health and beauty  9.800000
513  WALM099  Electronic accessories  5.950000
519  WALM100       Health and beauty  6.900000

[100 rows x 3 columns]

● Question: What is the busiest day of the week for each branch based on transaction
volume?

In [25]:
df['Day_of_Week'] = df['date_time'].dt.day_name()

In [26]:

transaction_volume = df.groupby(['Branch', 'Day_of_Week']).size().reset_index(name='Transaction_Volume')
busiest_day = transaction_volume.loc[transaction_volume.groupby('Branch')['Transaction_Volume'].idxmax()]
busiest_day

      Branch Day_of_Week  Transaction_Volume
2    WALM001    Saturday                  14
10   WALM002      Sunday                  15
17   WALM003      Sunday                  29
24   WALM004      Sunday                  14
29   WALM005      Monday                  16
..       ...         ...                 ...
670  WALM096     Tuesday                  15
672  WALM097      Friday                  14
680  WALM098      Monday                  14
689  WALM099      Sunday                  33
697  WALM100    Thursday                  12

[100 rows x 3 columns]

● Question: How many items were sold through each payment method?

In [27]:
df.groupby('payment_method')['quantity'].sum()

payment_method
Cash           4984.0
Credit card    9567.0
Ewallet        8932.0
Name: quantity, dtype: float64

● Question: What are the average, minimum, and maximum ratings for each category in
each city?

In [28]:
df.groupby(['City','category'])['rating'].max()

City     category
Abilene  Electronic accessories    8.8
         Fashion accessories       9.0
         Food and beverages        8.9
         Health and beauty         9.7
         Home and lifestyle        9.0
                                  ...
Weslaco  Fashion accessories       9.5
         Food and beverages        9.8
         Health and beauty         9.2
         Home and lifestyle        9.2
         Sports and travel         7.1
Name: rating, Length: 513, dtype: float64

In [29]:
df.groupby(['City','category'])['rating'].min()

City     category
Abilene  Electronic accessories    7.1
         Fashion accessories       4.0
         Food and beverages        6.0
         Health and beauty         9.7
         Home and lifestyle        4.0
                                  ...
Weslaco  Fashion accessories       3.0
         Food and beverages        7.1
         Health and beauty         4.3
         Home and lifestyle        3.0
         Sports and travel         4.1
Name: rating, Length: 513, dtype: float64

In [30]:
df.groupby(['City','category'])['rating'].mean()

City     category
Abilene  Electronic accessories    7.966667
         Fashion accessories       6.240625
         Food and beverages        6.950000
         Health and beauty         9.700000
         Home and lifestyle        6.096875
                                     ...
Weslaco  Fashion accessories       5.042012
         Food and beverages        8.733333
         Health and beauty         6.750000
         Home and lifestyle        5.183505
         Sports and travel         5.600000
Name: rating, Length: 513, dtype: float64

● Question: What is the total Revenue for each category, ranked from highest to lowest?

In [31]:
df["Total_Price"]=df['unit_price($)']*df['quantity']

In [32]:
df.groupby('category')['Total_Price'].sum().sort_values(ascending=False)

category
Fashion accessories       489480.90
Home and lifestyle        489250.06
Electronic accessories     78175.03
Food and beverages         53471.28
Sports and travel          52497.93
Health and beauty          46851.18
Name: Total_Price, dtype: float64

● Question: What is the total profit for each category, ranked from highest to lowest?

In [33]:
df['Profit']=df["Total_Price"]*df['profit_margin']

In [34]:
df.groupby('category')['Profit'].sum().sort_values(ascending=False)

category
Fashion accessories       192314.8932
Home and lifestyle        192213.6381
Electronic accessories     30772.4895
Food and beverages         21552.8622
Sports and travel          20613.8082
Health and beauty          18671.7345
Name: Profit, dtype: float64

● Question: What is the most frequently used payment method in each branch?

In [35]:
payment_counts = df.groupby('Branch')['payment_method'].value_counts()
top_payment_method = payment_counts.groupby('Branch').head(1).reset_index(name='count')
top_payment_method

     Branch payment_method  count
0   WALM001        Ewallet     45
1   WALM002        Ewallet     37
2   WALM003    Credit card    115
3   WALM004        Ewallet     44
4   WALM005        Ewallet     56
..      ...            ...    ...
95  WALM096        Ewallet     50
96  WALM097        Ewallet     38
97  WALM098        Ewallet     44
98  WALM099    Credit card     83
99  WALM100        Ewallet     42

[100 rows x 3 columns]

● Question: How many transactions occur in each shift (Morning, Afternoon, Evening)
across branches?

In [36]:
df['Hour'] = df['date_time'].dt.hour
def assign_shift(hour):
    if 6 <= hour < 12:
        return 'Morning'
    elif 12 <= hour < 18:
        return 'Afternoon'
    else:
        return 'Evening'
df['Shift'] = df['Hour'].apply(assign_shift)
shift_counts = df.groupby(['Branch', 'Shift']).size().reset_index(name='Transaction_Count')
shift_counts

      Branch      Shift  Transaction_Count
0    WALM001  Afternoon                 36
1    WALM001    Evening                 30
2    WALM001    Morning                  8
3    WALM002  Afternoon                 29
4    WALM002    Evening                 21
..       ...        ...                ...
295  WALM099    Evening                 32
296  WALM099    Morning                 40
297  WALM100  Afternoon                 24
298  WALM100    Evening                 19
299  WALM100    Morning                 19

[300 rows x 3 columns]

In [37]:
shift_counts.groupby(["Shift"])['Transaction_Count'].sum()

Shift
Afternoon    4636
Evening      3246
Morning      2087
Name: Transaction_Count, dtype: int64

● Question: Top 5 Profit producing branches?

In [48]:
df.groupby(['Branch'])['Profit'].sum().sort_values(ascending=False).head(5)

Branch
WALM009    12330.4032
WALM030    11741.0880
WALM003    11456.6988
WALM029    11197.1232
WALM046    10081.9152
Name: Profit, dtype: float64

● Question: Bottom 5 Profit producing branches?

In [49]:
df.groupby(['Branch'])['Profit'].sum().sort_values(ascending=False).tail(5)

Branch
WALM077    2285.8902
WALM098    1711.7874
WALM092    1662.8370
WALM100    1485.7812
WALM097    1327.8438
Name: Profit, dtype: float64

● Question: Top 5 Profit producing City?

In [57]:
df.groupby(['City'])['Profit'].sum().sort_values(ascending=False).head(5)

City
Weslaco        15296.0907
Waxahachie     13432.0989
Plano          12330.4032
Richardson     11741.0880
San Antonio    11456.6988
Name: Profit, dtype: float64

● Question: Bottom 5 Profit producing City?

In [65]:
df.groupby(['City'])['Profit'].sum().sort_values(ascending=False).tail(5)

City
Coppell          2285.8902
Mineral Wells    1711.7874
Lake Jackson     1662.8370
Canyon           1485.7812
Alice            1327.8438
Name: Profit, dtype: float64